onvif-java/docs/testing-output/GetRules.xml

<soap:Envelope
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<soap:Header>
		<wsse:Security>
			<wsse:UsernameToken>
				<wsse:Username>admin</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">yVT0Ok3m0UI9f4EYegFSRvdFO3c=</wsse:Password>
				<wsse:Nonce
					EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">MTQ0MzU2MTc5NQ==</wsse:Nonce>
				<wsu:Created>2021-12-15T18:39:34Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<ns2:GetRules
			xmlns:ns10="http://www.onvif.org/ver20/analytics/humanbody"
			xmlns:ns11="http://www.w3.org/2004/08/xop/include"
			xmlns:ns2="http://www.onvif.org/ver20/analytics/wsdl"
			xmlns:ns3="http://www.onvif.org/ver10/schema"
			xmlns:ns5="http://www.w3.org/2005/08/addressing"
			xmlns:ns6="http://docs.oasis-open.org/wsn/b-2"
			xmlns:ns7="http://docs.oasis-open.org/wsn/t-1"
			xmlns:ns8="http://docs.oasis-open.org/wsrf/bf-2"
			xmlns:ns9="http://www.onvif.org/ver20/analytics/humanface"
			xmlns:xmime="http://www.w3.org/2005/05/xmlmime">
			<ns2:ConfigurationToken>0</ns2:ConfigurationToken>
		</ns2:GetRules>
	</soap:Body>
</soap:Envelope>
