lecheng/Analytics/Get_Supported_Rules.xml

Request:

POST /onvif/analytics_service HTTP/1.1
Host: 192.168.71.21
Content-Type: application/soap+xml; charset=utf-8

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:tr2="http://www.onvif.org/ver20/media/wsdl" xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:tad="http://www.onvif.org/ver10/analyticsdevice/wsdl" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl">
  <s:Body>
    <tan:GetSupportedRules>
      <tan:ConfigurationToken>Analytics000</tan:ConfigurationToken>
    </tan:GetSupportedRules>
  </s:Body>
</s:Envelope>

Response:

HTTP/1.1 200 OK
Connection: close
Content-Length: 1662
Content-Type: application/soap+xml; charset=utf-8

<?xml version="1.0" encoding="utf-8" standalone="yes" ?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:sc="http://www.w3.org/2003/05/soap-encoding" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns1="http://www.onvif.org/ver10/topics" xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema"><s:Body><tan:GetSupportedRulesResponse><tan:SupportedRules><tt:RuleContentSchemaLocation>http://www.w3.org/2001/XMLSchema</tt:RuleContentSchemaLocation><tt:RuleDescription Name="tt:CellMotionDetector" Type="xs:string" fixed="true" maxInstances="1"><tt:Parameters><tt:SimpleItemDescription Name="MinCount" Type="xs:integer"></tt:SimpleItemDescription><tt:SimpleItemDescription Name="AlarmOnDelay" Type="xs:integer"></tt:SimpleItemDescription><tt:SimpleItemDescription Name="AlarmOffDelay" Type="xs:integer"></tt:SimpleItemDescription><tt:SimpleItemDescription Name="ActiveCells" Type="xs:base64Binary"></tt:SimpleItemDescription></tt:Parameters><tt:Messages IsProperty="true"><tt:Source><tt:SimpleItemDescription Name="VideoSourceConfigurationToken" Type="tt:ReferenceToken"></tt:SimpleItemDescription><tt:SimpleItemDescription Name="VideoAnalyticsConfigurationToken" Type="tt:ReferenceToken"></tt:SimpleItemDescription><tt:SimpleItemDescription Name="Rule" Type="xs:string"></tt:SimpleItemDescription></tt:Source><tt:Data><tt:SimpleItemDescription Name="IsMotion" Type="xs:boolean"></tt:SimpleItemDescription></tt:Data><tt:ParentTopic>tns1:RuleEngine/CellMotionDetector/Motion</tt:ParentTopic></tt:Messages></tt:RuleDescription></tan:SupportedRules></tan:GetSupportedRulesResponse></s:Body></s:Envelope>
